Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4SA16B.atdf
        <register caption="Endpoint Control and Status Register 1" name="UDP_CSR1" offset="0x34" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints) (Read/Write)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type (Read/Write)" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle (Read-only)" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO (Read-only)" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint Control and Status Register 2" name="UDP_CSR2" offset="0x38" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints) (Read/Write)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type (Read/Write)" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle (Read-only)" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO (Read-only)" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint Control and Status Register 3" name="UDP_CSR3" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints) (Read/Write)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type (Read/Write)" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle (Read-only)" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO (Read-only)" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint Control and Status Register 4" name="UDP_CSR4" offset="0x40" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints) (Read/Write)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type (Read/Write)" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle (Read-only)" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO (Read-only)" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
        <register caption="Endpoint Control and Status Register 5" name="UDP_CSR5" offset="0x44" rw="RW" size="4">
          <bitfield caption="Generates an IN Packet with Data Previously Written in the DPR" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Data Bank 0" mask="0x00000002" name="RX_DATA_BK0"/>
          <bitfield caption="Received Setup" mask="0x00000004" name="RXSETUP"/>
          <bitfield caption="Stall Sent" mask="0x00000008" name="STALLSENT"/>
          <bitfield caption="Transmit Packet Ready" mask="0x00000010" name="TXPKTRDY"/>
          <bitfield caption="Force Stall (used by Control, Bulk and Isochronous Endpoints)" mask="0x00000020" name="FORCESTALL"/>
          <bitfield caption="Receive Data Bank 1 (only used by endpoints with ping-pong attributes)" mask="0x00000040" name="RX_DATA_BK1"/>
          <bitfield caption="Transfer Direction (only available for control endpoints) (Read/Write)" mask="0x00000080" name="DIR"/>
          <bitfield caption="Endpoint Type (Read/Write)" mask="0x00000700" name="EPTYPE" values="UDP_CSR__EPTYPE"/>
          <bitfield caption="Data Toggle (Read-only)" mask="0x00000800" name="DTGLE"/>
          <bitfield caption="Endpoint Enable Disable" mask="0x00008000" name="EPEDS"/>
          <bitfield caption="Number of Bytes Available in the FIFO (Read-only)" mask="0x07FF0000" name="RXBYTECNT"/>
        </register>
